package game.client.data.dataBase
{
      import flash.utils.Dictionary;
      public class AchieveMenuConfig
      {
        /**
         * id
         */
        public var id:int;
        /**
         * 父类id
         */
        public var pid:int;
        /**
         * 名称
         */
        public var name:String;
        /**
         * 是否有连接
         */
        public var isHref:int;
        /**
         * 连接地址
         */
        public var href:String;
        /**
         * 图标
         */
        public var icon:int;
        public function AchieveMenuConfig(data:Array)
        {
            id = data[0];
            pid = data[1];
            name = data[2];
            isHref = data[3];
            href = data[4];
            icon = data[5];
        }
        private static var _data:Array = [
            [1, 1, "淘宝成就", 1, "淘宝", 1, ],
            [2, 1, "战力成就", 0, "0", 1, ],
            [3, 1, "财富成就", 0, "0", 1, ],
            [4, 1, "神魂成就", 1, "神魂神魂修炼", 1, ],
            [5, 1, "灵根成就", 1, "神魂-神魂灵根", 1, ],
            [6, 1, "等级成就", 0, "0", 1, ],
            [7, 1, "答题成就", 0, "0", 1, ],
            [8, 1, "分享成就", 1, "暂无", 1, ],
            [9, 1, "送花成就", 1, "送花界面", 1, ],
            [10, 1, "帮派奇术", 1, "帮派-帮派奇术", 1, ],
            [16, 2, "宠物资质", 1, "宝宝-宝宝资质", 1, ],
            [17, 2, "宠物战力", 0, "1", 1, ],
            [18, 2, "宠物成长", 1, "宝宝-宝宝成长", 1, ],
            [19, 2, "宠物等级", 0, "1", 1, ],
            [20, 2, "宠物等阶", 1, "宝宝-宝宝信息", 1, ],
            [21, 2, "宠物技能", 1, "宝宝-宝宝技能", 1, ],
            [22, 2, "宠物仙术", 1, "宝宝-宝宝仙术", 1, ],
            [31, 3, "护送任务", 1, "每日任务", 1, ],
            [32, 3, "历练任务", 1, "每日任务", 1, ],
            [33, 3, "帮派试炼", 1, "每日任务", 1, ],
            [34, 3, "你画我猜", 1, "每日任务", 1, ],
            [35, 3, "降妖除魔", 1, "每日任务", 1, ],
            [36, 3, "帮会任务", 1, "每日任务", 1, ],
            [46, 4, "镶嵌宝石", 1, "宝石-镶嵌宝石", 1, ],
            [47, 4, "翅膀成就", 1, "翅膀", 1, ],
            [48, 4, "坐骑成就", 1, "坐骑-坐骑信息", 1, ],
            [49, 4, "强化成就", 1, "炼器-装备强化", 1, ],
            [50, 4, "时装成就", 1, "我的衣柜", 1, ],
            [51, 4, "宝石套装", 1, "宝石-镶嵌宝石", 1, ],
            [52, 4, "装备洗练", 1, "炼器-装备洗炼", 1, ],
            [53, 4, "分解装备", 1, "炼器-装备分解", 1, ],
            [54, 4, "坐骑进阶", 1, "坐骑-坐骑进阶", 1, ],
            [61, 5, "军阁副本", 1, "日常副本", 1, ],
            [62, 5, "轮回塔", 1, "日常副本", 1, ],
            [63, 5, "斗法", 1, "日常副本", 1, ],
            [64, 5, "群仙诛魔", 1, "日常副本", 1, ],
            [65, 5, "劫镖", 0, "1", 1, ],
            [76, 6, "隐藏成就1", 0, "1", 1, ],
            [77, 6, "隐藏成就2", 0, "1", 1, ],
            [78, 6, "隐藏成就3", 0, "1", 1, ],
        ];
        private static function InitData(): Dictionary
        {
            var dic:Dictionary = new Dictionary();
            for (var i:int = 0; i < _data.length; i++)
            {
                var data:Array = (_data[i] as Array);
                dic[data[0]] = new AchieveMenuConfig(data);
            }
            return dic;
        }
        public static var configData:Dictionary = InitData();
    }
}
